doc/src/simple-cubic/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.1;
        smoother        GaussSeidel;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
    }
    
    /*Phi
    {
        solver  GAMG;
        smoother    GaussSeidel;
        tolerance   1e-08;
        relTol  0.01;
    }*/
    Phi
    {
        solver GAMG;
        smoother DIC;
        cacheAgglomeration on;
        agglomerator faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels 1;

        tolerance 1e-06;
        relTol 0.01;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}

cache
{
    grad(U);
} 

SIMPLE
{
    nNonOrthogonalCorrectors 10;

    residualControl
    {
        p               1e-3;
        U               1e-3;
    }
}

relaxationFactors
{
    fields
    {
        p               0.05;
    }
    equations
    {
        U               0.2;
    }
}


// ************************************************************************* //
